# 1. Importing the Libraries

In [1]:
# importing the libraries 
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns
import numpy as np

# 2. Data

In [5]:
type(df['gender'].mode())

pandas.core.series.Series

## * Loading the data

In [2]:
# loading the data 
df = pd.read_csv("F:\my_folders\DATA\lab2.csv")

# viewing the head 
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,32403,city_41,0.827,Male,Has relevent experience,Full time course,Graduate,STEM,9,<10,NaN,1,21.0
1,9858,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,5,NaN,Pvt Ltd,1,98.0
2,31806,city_21,0.624,Male,No relevent experience,no_enrollment,High School,NaN,<1,NaN,Pvt Ltd,never,15.0
3,27385,city_13,0.827,Male,Has relevent experience,no_enrollment,Masters,STEM,11,Oct-49,Pvt Ltd,1,39.0
4,27724,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,10000+,Pvt Ltd,>4,72.0

In [3]:
import copy

df_bays = copy.deepcopy(df)

In [5]:
df_bays.dropna(inplace = True)

In [10]:
df_bays.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
3,27385,city_13,0.827,Male,Has relevent experience,no_enrollment,Masters,STEM,11,Oct-49,Pvt Ltd,1,39.0
4,27724,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,10000+,Pvt Ltd,>4,72.0
11,9272,city_90,0.698,Male,Has relevent experience,no_enrollment,Graduate,STEM,20,Oct-49,Pvt Ltd,2,51.0
12,14249,city_46,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,8,100-500,Other,never,48.0
16,7865,city_21,0.624,Male,Has relevent experience,no_enrollment,Masters,STEM,4,100-500,Pvt Ltd,1,4.0

In [11]:
from sklearn.naive_bayes import CategoricalNB

In [13]:
df_bays.drop(['enrollee_id','city','city_development_index','training_hours'],inplace = True,axis = 1)

In [15]:
df_b_enc = pd.get_dummies(df_bays)

In [16]:
df_b_enc

,gender_Female,gender_Male,gender_Other,relevent_experience_Has relevent experience,relevent_experience_No relevent experience,enrolled_university_Full time course,enrolled_university_Part time course,enrolled_university_no_enrollment,education_level_Graduate,education_level_Masters,...,company_type_NGO,company_type_Other,company_type_Public Sector,company_type_Pvt Ltd,last_new_job_1,last_new_job_2,last_new_job_3,last_new_job_4,last_new_job_>4,last_new_job_never
3,0,1,0,1,0,0,0,1,0,1,...,0,0,0,1,1,0,0,0,0,0
4,0,1,0,1,0,0,0,1,1,0,...,0,0,0,1,0,0,0,0,1,0
11,0,1,0,1,0,0,0,1,1,0,...,0,0,0,1,0,1,0,0,0,0
12,0,1,0,1,0,0,0,1,1,0,...,0,1,0,0,0,0,0,0,0,1
16,0,1,0,1,0,0,0,1,0,1,...,0,0,0,1,1,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2113,0,1,0,1,0,0,0,1,1,0,...,0,0,1,0,1,0,0,0,0,0
2115,0,1,0,1,0,0,0,1,1,0,...,0,0,0,1,1,0,0,0,0,0
2117,0,1,0,0,1,0,1,0,1,0,...,0,0,0,0,0,0,0,0,0,1
2121,0,1,0,0,1,0,0,1,0,1,...,0,0,0,1,0,0,0,0,1,0
2128,0,1,0,1,0,0,0,1,0,1,...,0,0,0,1,0,1,0,0,0,0

###  * Checking the data types and shape

In [671]:
# checking the type of each column in df
print(df.dtypes)

# lets check the length of dataset 
print(df.shape)

enrollee_id                 int64
city                       object
city_development_index    float64
gender                     object
relevent_experience        object
enrolled_university        object
education_level            object
major_discipline           object
experience                 object
company_size               object
company_type               object
last_new_job               object
training_hours            float64
dtype: object
(2129, 13)

# 3. Handling Missing Values and labels

In [672]:
# finding the total number of null values in the df 
df.isnull().sum()

enrollee_id                 0
city                        0
city_development_index      3
gender                    508
relevent_experience        20
enrolled_university        41
education_level            63
major_discipline          312
experience                  5
company_size              622
company_type              634
last_new_job               40
training_hours             20
dtype: int64

###  * city_development_index

In [673]:
# getting values 
ct_73 = df['city_development_index'][df['city' ]== 'city_73'].mode()[0]    # value for city_73
ct_45 = df['city_development_index'][df['city' ]== 'city_45'].mode()[0]    # value for city_45
ct_114 = df['city_development_index'][df['city' ]== 'city_114'].mode()[0]    # value for city_114

 
df['city_development_index'][30] = ct_73
df['city_development_index'][40] = ct_45
df['city_development_index'][92] = ct_114

###  * relevent_experience, education_level,major_discipline, enrolled_university, gender

In [674]:

# we can see that the relevant experience value count is suffienctly large so lets the fill the missing
df.relevent_experience.fillna('Has relevent experience',inplace=  True)

# replacing missing education level with mode ( 63 values ) 
df.education_level.fillna(df.education_level.mode()[0],inplace = True)


# replacign missing values in major discipline using mode 
df.major_discipline.fillna(df.major_discipline.mode()[0], inplace = True)

# replacing missing values in enrolled university feature using mode
df.enrolled_university.fillna(df.enrolled_university.mode()[0],inplace = True)

# replacing nan values in gender with missing 
df.gender.fillna('Missing',inplace= True)

###  * company_size feature

In [675]:
# converting company size to numericals - 
def convert_cmp_size(val_string):
    if val_string == '<10':
        return 1
    if val_string == "Oct-49":
        return 2
    if val_string == '50-99':
        return 3
    if val_string == '100-500':
        return 4
    if val_string == '500-999':
        return 5
    if val_string == '1000-4999':
        return 6
    if val_string == "5000-9999":
        return 7
    if val_string == "10000+":
        return 8
df['company_size'] = df['company_size'].apply(convert_cmp_size)


# filling company size by 4 
df.company_size.fillna(4,inplace = True)

### * experience feature

In [676]:
# replacing missing experience with mode ( 5 values)
df.experience.fillna(df.experience.mode()[0],inplace= True)

# creating a function to handle the special values in experience column 
def experience_imputer(data):
    if data  == '<1':
        return 0
    if data == '>20':
        return 21
    else:
        return data 

# applying the function into experience column feature 
df.experience = df.experience.apply(experience_imputer)

# converting the object data type to numerical 
df.experience = df.experience.astype(int)

In [677]:
# df_new = df.dropna()
# df_new.experience = df_new.experience.astype(int)
# data = df_new[['experience','company_size']]
# correlation = data.corr(method='pearson')
# correlation           # so experience and company size are nor correlated so lets repalce it with a median size

### * company_size

In [678]:


# filling company_type missing values by unkn_type 
df.company_type.fillna('Unkn_type', inplace = True)

# changing the datatype 
df.company_size = df.company_size.astype(int)

###     * last_new_job feature

In [679]:

# replacing missing last_new_job values with mode ( 40 values )
df.last_new_job.fillna(df.last_new_job.mode()[0],inplace=True)


# converting last_new_job feature into numerical 
def last_job(data):
    if data == ">4":
        return 5
    if data == 'never':
        return 0
    else:
        return data
df.last_new_job = df.last_new_job.apply(last_job)
df.last_new_job = df.last_new_job.astype(int)

# 4. Handling ouriers

In [680]:
# finding the median training hours for males - we interested in median bcs training_hours column has a lot of outliers
print('median_trainin_hours for male = ',df[df['gender']=='Male']['training_hours'].median())
print('median_trainin_hours for female = ',df[df['gender']=='Female']['training_hours'].median())

df.training_hours.fillna(45,inplace = True)

# fixing the outliers in training_hours
def fix_out(data):
    if data> 140:
        return df.training_hours.median()
    else:
        return data


# applying the function 
df.training_hours = df.training_hours.apply(fix_out)

median_trainin_hours for male =  48.0
median_trainin_hours for female =  42.0

# 5. Droping unecessary features

In [681]:

# droping id column 
df.drop('enrollee_id',axis = 1,inplace = True)


# droping city column - unecessary 
df.drop('city', inplace= True, axis = 1)

# 6. Dummy Encoding for categorical variables

In [682]:

cat_features = df.drop(['city_development_index','experience','company_size','last_new_job','training_hours'] , axis = 1).columns

enc_df = pd.get_dummies(df[cat_features])


enc_final = enc_df.drop(['gender_Missing','relevent_experience_No relevent experience','enrolled_university_no_enrollment','education_level_Phd','major_discipline_Other', 'company_type_Other'],axis =1)

In [683]:
# removing the coded features from our original dataframe 

df_num = df.drop(df[cat_features],axis = 1)
df_num.head()

   city_development_index  experience  ...  last_new_job  training_hours
0                   0.827           9  ...             1            21.0
1                   0.920           5  ...             1            98.0
2                   0.624           0  ...             0            15.0
3                   0.827          11  ...             1            39.0
4                   0.920          21  ...             5            72.0

[5 rows x 5 columns]

In [684]:
# merging the df_num and enc_final
final_df = pd.concat([df_num,enc_final],axis = 1)

In [685]:
# checking the dtypes 
print('total_no_features ' , len(final_df.dtypes))
print('---------------------------')
print(final_df.dtypes)

total_no_features  26
---------------------------
city_development_index                         float64
experience                                       int32
company_size                                     int32
last_new_job                                     int32
training_hours                                 float64
gender_Female                                    uint8
gender_Male                                      uint8
gender_Other                                     uint8
relevent_experience_Has relevent experience      uint8
enrolled_university_Full time course             uint8
enrolled_university_Part time course             uint8
education_level_Graduate                         uint8
education_level_High School                      uint8
education_level_Masters                          uint8
education_level_Primary School                   uint8
major_discipline_Arts                            uint8
major_discipline_Business Degree                 uint8
major_discipline_Humanities                      uint8
major_discipline_No Major                        uint8
major_discipline_STEM                            uint8
company_type_Early Stage Startup                 uint8
company_type_Funded Startup                      uint8
company_type_NGO                                 uint8
company_type_Public Sector                       uint8
company_type_Pvt Ltd                             uint8
company_type_Unkn_type                           uint8
dtype: object

# 7. Final DataFrame

In [686]:
final_df.head(10)

   city_development_index  ...  company_type_Unkn_type
0                   0.827  ...                       1
1                   0.920  ...                       0
2                   0.624  ...                       0
3                   0.827  ...                       0
4                   0.920  ...                       0
5                   0.899  ...                       1
6                   0.624  ...                       0
7                   0.920  ...                       1
8                   0.878  ...                       1
9                   0.624  ...                       0

[10 rows x 26 columns]